In [1]:
import pandas as pd 
import numpy as np

# 创建DataFrame

In [2]:
'''
    通过列表创建
'''
li = [[1,2,3,4],[5,6,7,8]]

df01 = pd.DataFrame(li)
df01

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [3]:
df01.index

RangeIndex(start=0, stop=2, step=1)

In [4]:
df01.columns

RangeIndex(start=0, stop=4, step=1)

In [5]:
df01.values

array([[1, 2, 3, 4],
       [5, 6, 7, 8]], dtype=int64)

In [10]:
'''
    通过series创建
'''
ser01 = pd.Series([1,2,3,4])
ser02 = pd.Series([1,2,3,4])
df02 = pd.DataFrame([ser01,ser02])
df02

   0  1  2  3
0  1  2  3  4
1  1  2  3  4

In [14]:
'''
    数组创建
'''
arr = np.random.randint(1,9,(3,3))
df02 = pd.DataFrame(arr)
df02

   0  1  2
0  4  7  3
1  2  4  7
2  8  7  4

In [17]:
'''
    字典创建
'''
dic = {
    'name':['joe','anne','yilianna'],   #  key 就是 列索引
    'age':[18,19,20],
    'class':1                          # 整列数据会被标量填充
} 
df03 = pd.DataFrame(dic)
df03

   age  class      name
0   18      1       joe
1   19      1      anne
2   20      1  yilianna

In [19]:
'''
    重置索引
'''
df03.index = list('abc')
df03

   age  class      name
a   18      1       joe
b   19      1      anne
c   20      1  yilianna

In [20]:
df03.reset_index(drop = True)

   age  class      name
0   18      1       joe
1   19      1      anne
2   20      1  yilianna

In [23]:
df03.columns = list('ABC')
df03

    A  B         C
a  18  1       joe
b  19  1      anne
c  20  1  yilianna

# 值获取

In [24]:
'''
    列操作  查
'''
dic = {
    'name':['joe','anne','yilianna'],   #  key 就是 列索引
    'age':[18,19,20],
    'class':1                          # 整列数据会被标量填充
} 
df03 = pd.DataFrame(dic)
df03

   age  class      name
0   18      1       joe
1   19      1      anne
2   20      1  yilianna

In [25]:
df03['name']   # 返回一个series

0         joe
1        anne
2    yilianna
Name: name, dtype: object

In [26]:
# 获取多列数据 
df03[['name','age']]   # 当获取多列数据的时候返回DataFrame

       name  age
0       joe   18
1      anne   19
2  yilianna   20

In [33]:
'''
    增
'''
df03['address'] = ['usa','uk','chn']   # 添加不存在的列索引
df03

   age  class      name address
0   18      1       joe     usa
1   19      1      anne      uk
2   20      1  yilianna     chn

In [32]:
'''
    删
'''
df03.pop('address')   # 返回被删除的内容
df03

   age  class      name
0   18      1       joe
1   19      1      anne
2   20      1  yilianna

In [34]:
del(df03['address'])  # del 删除
df03

   age  class      name
0   18      1       joe
1   19      1      anne
2   20      1  yilianna

In [36]:
'''
    改
'''
df03['class'] = [3,4,5]
df03

   age  class      name
0   18      3       joe
1   19      4      anne
2   20      5  yilianna

In [39]:
'''
    行操作  查
'''
df03.loc[0]

age       18
class      3
name     joe
Name: 0, dtype: object

In [40]:
# 获取多行数据
df03.loc[[0,2]]

   age  class      name
0   18      3       joe
2   20      5  yilianna

In [41]:
df03.loc[:]

   age  class      name
0   18      3       joe
1   19      4      anne
2   20      5  yilianna

In [42]:
# 选择某行某列
df03.loc[0,'name']

'joe'

In [43]:
df03.loc[[0,2],'name']

0         joe
2    yilianna
Name: name, dtype: object

In [44]:
df03.loc[[0,2],['name','age']]

       name  age
0       joe   18
2  yilianna   20

In [45]:
# 切片
df03.loc[1:,'class':'name']

   class      name
1      4      anne
2      5  yilianna

In [46]:
df03.index = ['a','b','c']
df03

   age  class      name
a   18      3       joe
b   19      4      anne
c   20      5  yilianna

In [49]:
df03.iloc[0]   # 可以使用数字索引获取

age       18
class      3
name     joe
Name: a, dtype: object

In [50]:
df03.iloc[[0,1],[0,1]]

   age  class
a   18      3
b   19      4

In [54]:
'''
    增
'''
df03.loc['d'] = [16,6,'ronaldo']    # 指定一个不存在的行索引  对应上每一列数据
df03

   age  class      name
a   18      3       joe
b   19      4      anne
c   20      5  yilianna
d   16      6   ronaldo

In [53]:
'''
    删
'''
df03 = df03.drop('d')
df03

   age  class      name
a   18      3       joe
b   19      4      anne
c   20      5  yilianna

In [57]:
'''
    改
'''
df03.loc['c'] = [18,9,'messi']
df03

   age  class     name
a   18      3      joe
b   19      4     anne
c   18      9    messi
d   16      6  ronaldo